elasticsearch-queries.html
---
layout: page
title: Using the REST API to See Data from Elasticsearch
---

<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-55726337-1', 'auto');
  ga('send', 'pageview');

</script>

<p>
ElasticSearch has a rich REST interface that supports queries on date
ranges, terms, and aggregations. The programming interface for
custom queries or output is straight-forward.
</p>

<p>
The query below asks for the top 10 commands run (these are the <code>comm</code>
field in Elasticsearch; looking at the details of the Kibana screens
will show all of the fields available), the top 5 users of each
command (in the <code>username</code> field), the total number of times that
command has been run (in the <code>doc_count</code> field that is included in the
output by default) and the total number of unique users to have run
this particular executable (in the <code>top_users</code> aggregation that
applies &ldquo;cardinality&rdquo; (uniqueness) to the field <code>username</code>.
</p>

<pre class="example">
curl -XGET 'http://localhost:9200/\
  flux-software-*/_search?pretty' -d '{
 "aggs": {
  "comm_users": {
   "terms": {
    "field": "comm",
    "size": 10,
    "order": { "top_users" : "desc" }
   },
   "aggs": {
    "top_users": {
     "cardinality": {
      "field": "username"
     }
    },
    "users": {
     "terms": {
      "field": "username",
      "size": 5
     }
    }
   }
  }
 }
}'
</pre>

<div class="org-src-container">

<pre class="src src-JSON">"key" : "matlab",
"doc_count" : 16301,
"users" : {
  "buckets" : [ {
    "key" : "RedactedUser01",
    "doc_count" : 3491
  }, {
    "key" : "RedactedUser02",
    "doc_count" : 3330
  }, {
    "key" : "RedactedUser03",
    "doc_count" : 966
  }, {
    "key" : "RedactedUser04",
    "doc_count" : 669
  }, {
    "key" : "RedactedUser05",
    "doc_count" : 651
  } ]
},
"top_users" : {
  "value" : 78
}
</pre>
</div>
